# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [18]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/thieu1995/csv-files/main/data/pandas/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [19]:
url = '/home/dotronghiep/Documents/Uni/Year3_Term3/computing_for_AI/data/baby_names.csv'
baby_name = pd.read_csv(url)
baby_name.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Step 4. See the first 10 entries

In [20]:
baby_name.iloc[:10]

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [21]:
baby_name.drop(['Unnamed: 0', 'Id'], axis=1, inplace=True)
baby_name.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [28]:
male = sum(baby_name['Gender'] == 'M')
female = sum(baby_name['Gender'] == 'F')
print(f'Male: {male}, Female: {female}')

Male: 0, Female: 1440

### Step 7. Group the dataset by name and assign to names

In [35]:
# Group the dataset by name and assign to names
names = baby_name.groupby('Name')
names.size()

Name
Aaliyah    7
Abby       1
Abigail    7
Addison    6
Adeline    2
          ..
Vivian     2
Willow     6
Winter     1
Zoe        7
Zoey       7
Length: 385, dtype: int64

### Step 8. How many different names exist in the dataset?

In [36]:
len(names)

385

### Step 9. What is the name with most occurrences?

In [40]:
sorted_names = names.size().sort_values(ascending=False)
sorted_names.head()

Name
Aaliyah    7
Haley      7
Kylie      7
Kira       7
Kaylee     7
dtype: int64

### Step 10. How many different names have the least occurrences?

In [44]:
len(sorted_names[sorted_names == sorted_names.min()])

103

### Step 11. What is the median name occurrence?

In [46]:
print(sorted_names.median())

3.0

### Step 12. What is the standard deviation of names?

In [47]:
print(sorted_names.std())

2.317295688374556

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [49]:
sorted_names.describe()

count    385.000000
mean       3.740260
std        2.317296
min        1.000000
25%        1.000000
50%        3.000000
75%        6.000000
max        7.000000
dtype: float64